# What do we have so far

After creating our topology with the YAML file, we will have the following configuration below:

![Topology](images/topology.png)

This is just the barebones topology with only the management interfaces automatically configured thanks to containerlab.

## Goal

Our goal here is to create a fully configured leaf and spine topology with 2 spine and 2 leaf devices that interconnect 3 hosts with BGP as our main routing protocol to create our routes.

To make life easier, in the folder start_config, I left starting configurations in json files for the switches and scripts to run for the hosts that you can copy paste as needed.

For the routers, go into the /etc/opt/srlinux/config.json and replace what is in there with the starting configurations 

For the hosts, they will be bash scripts that you can make executable then run.

## Configuring Interfaces 

For this initial configuration we will configure the interfaces that point towards both the hosts and the spine switches to establish connectivity from hosts to spines.

The example below will be the configuration for the interfaces pointing towards the spine switches and loopback:

Leaf interface assignment:

leaf1:
- ethernet-1/1 = 10.1.1.1 (To spine 1)
- ethernet-1/2 = 10.2.1.1 (To spine 2)

leaf2:
- ethernet-1/1 = 10.1.2.1 (To spine 1)
- ethernet-1/2 = 10.2.2.1 (To spine 2)

```
# <1/2> just using to reduce how much typing to show what to change depending on the interface you will currently be working on as well as the addressing

--{ running }--[  ]--
A:root@leaf1# enter candidate

--{ candidate shared default }--[  ]--
A:root@leaf1# interface ethernet-1/<1/2>

--{ candidate shared default }--[ interface ethernet-1/<1/2> ]--
A:root@leaf1# admin-state enable 

--{ candidate shared default }--[ interface ethernet-1/<1/2> ]--
A:root@leaf1# subinterface 0

--{ candidate shared default }--[ interface ethernet-1/<1/2> subinterface 0 ]-- 
A:root@leaf1# admin-state enable 

--{ candidate shared default }--[ interface ethernet-1/<1/2> subinterface 0]--
A:root@leaf1# ipv4 admin-state enable address 10.<1/2>.<1/2>.1/31 

--{ candidate shared default }--[ interface ethernet-1/<1/2> subinterface 0 ]--
A:root@leaf1# / 

--{ candidate shared default }--[  ]--
A:root@leaf1# interface lo0

--{ candidate shared default }--[ interface lo0 ]--
A:root@leaf1# admin-state enable 

--{ candidate shared default }--[ interface lo0 ]--
A:root@leaf1# subinterface 0 

--{ candidate shared default }--[ interface lo0 subinterface 0 ]--
A:root@leaf1# admin-state enable 

--{ candidate shared default }--[ interface lo0 subinterface 0 ]--
A:root@leaf1# ipv4 admin-state enable address 100.0.2.1 # 100.0.2.2 when working on leaf 2 

```

The following example below is for leaf 1 on interface ethernet-1/10, and it is as easy as changing the interface number 
```
--{ running }--[  ]--
A:root@leaf1# enter candidate

--{ candidate shared default }--[  ]--
A:root@leaf1# interface ethernet-1/10

--{ candidate shared default }--[ interface ethernet-1/10 ]--
A:root@leaf1# admin-state enable 

--{ candidate shared default }--[ interface ethernet-1/10 ]--
A:root@leaf1# vlan-tagging true

--{ candidate shared default }--[ interface ethernet-1/10 ]--
A:root@leaf1# subinterface 0 

--{ candidate shared default }--[ interface ethernet-1/10 subinterface 0 ]--
A:root@leaf1# admin-state enable type bridged

--{ candidate shared default }--[ interface ethernet-1/10 ]--
A:root@leaf1# vlan 

--{ candidate shared default }--[ interface ethernet-1/10 vlan ]--
A:root@leaf1# encap untagged 
```

Purpose of configuring the interface like this:
- We will be forwarding traffic from host 10-12 using MAC forwarding (this will be configured later)
- Traffic coming from these hosts will be untagged (hence why in the VLAN context we have encap untagged)

IMPORTANT TO NOTE:

- interface ethernet-1/<1/2> cannot be used to ping their respective interface as we haven't configured the leaves to be within a network instance yet.
- On leaf 2, there is only 1 host connected and it has VLAN tagging with id 1 so when configuring that, place the ip and vlan configuration into subinterface 1 rather than subinterface 0.

Once the interfaces have been configured do the following:

```system lldp admin-state enable```

Then after running the ```show system lldp neighbor``` command, we can confirm that each leaf router has been successfully connected to both spines via interfaces ethernet-1/1 and 1/2.

While we have a successful connection between the devices as seen through system lldp, we will not be able to ping because we haven't attached these interfaces into a network-instance yet so there won't be any routing.
